app/controllers/chatroom_controller.rb

SELECT "users".* FROM "users"
SELECT "messages".* FROM "messages"
---
    def index
      @users = User.all
      @messages = Message.all