app/controllers/message_controller.rb

INSERT INTO "messages" ("message", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "test"], ["created_at", "2022-02-03 10:11:46.733201"], ["updated_at", "2022-02-03 10:11:46.733201"], ["user_id", 3]]
---
    def create
        @message = current_user.messages.new(sanitize_message)
        if @message.save